---
kind: method
id: M:Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.Dispose
source: html/72fd8d98-d76a-6eda-b513-c0839457cdec.htm
---
# Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.Dispose Method

Releases all resources used by the DuplicateTypeNamesHandlerArgs

## Syntax (C#)
```csharp
public void Dispose()
```